## Plan Result (543: ithc_appgateway - TerraformPlanApply)




<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * module.appgateway.azurerm_application_gateway.ag[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.appgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw"
        name                              = "aks-fe-00-ithc-agw"
        tags                              = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "ithc"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.143.15.250",
              + "10.143.31.250",
            ]
          + name         = "opal-frontend"
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendHttpSettingsCollection/c100-application" -> null
          - name                                = "c100-application" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/c100-application" -> null
          - probe_name                          = "c100-application" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendHttpSettingsCollection/darts-portal" -> null
          - name                                = "darts-portal" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/darts-portal" -> null
          - probe_name                          = "darts-portal" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendHttpSettingsCollection/hmcts-courtfines-ithc" -> null
          - name                                = "hmcts-courtfines-ithc" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/hmcts-courtfines-ithc" -> null
          - probe_name                          = "hmcts-courtfines-ithc" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendHttpSettingsCollection/juror-bureau" -> null
          - name                                = "juror-bureau" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/juror-bureau" -> null
          - probe_name                          = "juror-bureau" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendHttpSettingsCollection/juror-public" -> null
          - name                                = "juror-public" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/juror-public" -> null
          - probe_name                          = "juror-public" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendHttpSettingsCollection/pip-frontend" -> null
          - name                                = "pip-frontend" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/pip-frontend" -> null
          - probe_name                          = "pip-frontend" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendHttpSettingsCollection/pip-frontend-b2c-sign-in" -> null
          - name                                = "pip-frontend-b2c-sign-in" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/pip-frontend-b2c-sign-in" -> null
          - probe_name                          = "pip-frontend-b2c-sign-in" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendHttpSettingsCollection/pip-frontend-b2c-staff" -> null
          - name                                = "pip-frontend-b2c-staff" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/pip-frontend-b2c-staff" -> null
          - probe_name                          = "pip-frontend-b2c-staff" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendHttpSettingsCollection/sds-api-mgmt" -> null
          - name                                = "sds-api-mgmt" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/sds-api-mgmt" -> null
          - probe_name                          = "sds-api-mgmt" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendHttpSettingsCollection/toffee" -> null
          - name                                = "toffee" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/toffee" -> null
          - probe_name                          = "toffee" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "opal-frontend"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "opal-frontend"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
            # (3 unchanged attributes hidden)
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendHttpSettingsCollection/c100-application"
          + name                                = "c100-application"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/c100-application"
          + probe_name                          = "c100-application"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendHttpSettingsCollection/darts-portal"
          + name                                = "darts-portal"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/darts-portal"
          + probe_name                          = "darts-portal"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendHttpSettingsCollection/hmcts-courtfines-ithc"
          + name                                = "hmcts-courtfines-ithc"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/hmcts-courtfines-ithc"
          + probe_name                          = "hmcts-courtfines-ithc"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendHttpSettingsCollection/juror-bureau"
          + name                                = "juror-bureau"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/juror-bureau"
          + probe_name                          = "juror-bureau"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendHttpSettingsCollection/juror-public"
          + name                                = "juror-public"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/juror-public"
          + probe_name                          = "juror-public"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendHttpSettingsCollection/pip-frontend"
          + name                                = "pip-frontend"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/pip-frontend"
          + probe_name                          = "pip-frontend"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendHttpSettingsCollection/pip-frontend-b2c-sign-in"
          + name                                = "pip-frontend-b2c-sign-in"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/pip-frontend-b2c-sign-in"
          + probe_name                          = "pip-frontend-b2c-sign-in"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = "/subscript

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

              = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/requestRoutingRules/pip-frontend-b2c-staff" -> null
          - name                        = "pip-frontend-b2c-staff" -> null
          - priority                    = 50 -> null
          - rewrite_rule_set_id         = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name       = "x_fwded_proto" -> null
          - rule_type                   = "Basic" -> null
            # (4 unchanged attributes hidden)
        }
      - request_routing_rule {
          - backend_address_pool_id     = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendAddressPools/sds-api-mgmt" -> null
          - backend_address_pool_name   = "sds-api-mgmt" -> null
          - backend_http_settings_id    = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendHttpSettingsCollection/sds-api-mgmt" -> null
          - backend_http_settings_name  = "sds-api-mgmt" -> null
          - http_listener_id            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/httpListeners/sds-api-mgmt" -> null
          - http_listener_name          = "sds-api-mgmt" -> null
          - id                          = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/requestRoutingRules/sds-api-mgmt" -> null
          - name                        = "sds-api-mgmt" -> null
          - priority                    = 60 -> null
          - rewrite_rule_set_id         = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name       = "x_fwded_proto" -> null
          - rule_type                   = "Basic" -> null
            # (4 unchanged attributes hidden)
        }
      - request_routing_rule {
          - backend_address_pool_id     = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendAddressPools/toffee" -> null
          - backend_address_pool_name   = "toffee" -> null
          - backend_http_settings_id    = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendHttpSettingsCollection/toffee" -> null
          - backend_http_settings_name  = "toffee" -> null
          - http_listener_id            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/httpListeners/toffee" -> null
          - http_listener_name          = "toffee" -> null
          - id                          = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/requestRoutingRules/toffee" -> null
          - name                        = "toffee" -> null
          - priority                    = 10 -> null
          - rewrite_rule_set_id         = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name       = "x_fwded_proto" -> null
          - rule_type                   = "Basic" -> null
            # (4 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendAddressPools/c100-application"
          + backend_address_pool_name  = "c100-application"
          + backend_http_settings_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendHttpSettingsCollection/c100-application"
          + backend_http_settings_name = "c100-application"
          + http_listener_id           = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/httpListeners/c100-application"
          + http_listener_name         = "c100-application"
          + id                         = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/requestRoutingRules/c100-application"
          + name                       = "c100-application"
          + priority                   = 20
          + rewrite_rule_set_id        = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendAddressPools/juror-bureau"
          + backend_address_pool_name  = "juror-bureau"
          + backend_http_settings_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendHttpSettingsCollection/juror-bureau"
          + backend_http_settings_name = "juror-bureau"
          + http_listener_id           = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/httpListeners/juror-bureau"
          + http_listener_name         = "juror-bureau"
          + id                         = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/requestRoutingRules/juror-bureau"
          + name                       = "juror-bureau"
          + priority                   = 80
          + rewrite_rule_set_id        = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendAddressPools/juror-public"
          + backend_address_pool_name  = "juror-public"
          + backend_http_settings_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendHttpSettingsCollection/juror-public"
          + backend_http_settings_name = "juror-public"
          + http_listener_id           = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/httpListeners/juror-public"
          + http_listener_name         = "juror-public"
          + id                         = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/requestRoutingRules/juror-public"
          + name                       = "juror-public"
          + priority                   = 70
          + rewrite_rule_set_id        = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendAddressPools/pip-frontend"
          + backend_address_pool_name  = "pip-frontend"
          + backend_http_settings_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendHttpSettingsCollection/pip-frontend"
          + backend_http_settings_name = "pip-frontend"
          + http_listener_id           = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/httpListeners/pip-frontend"
          + http_listener_name         = "pip-frontend"
          + id                         = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/requestRoutingRules/pip-frontend"
          + name                       = "pip-frontend"
          + priority                   = 30
          + rewrite_rule_set_id        = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendAddressPools/pip-frontend-b2c-sign-in"
          + backend_address_pool_name  = "pip-frontend-b2c-sign-in"
          + backend_http_settings_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendHttpSettingsCollection/pip-frontend-b2c-sign-in"
          + backend_http_settings_name = "pip-frontend-b2c-sign-in"
          + http_listener_id           = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/httpListeners/pip-frontend-b2c-sign-in"
          + http_listener_name         = "pip-frontend-b2c-sign-in"
          + id                         = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/requestRoutingRules/pip-frontend-b2c-sign-in"
          + name                       = "pip-frontend-b2c-sign-in"
          + priority                   = 40
          + rewrite_rule_set_id        = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendAddressPools/pip-frontend-b2c-staff"
          + backend_address_pool_name  = "pip-frontend-b2c-staff"
          + backend_http_settings_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendHttpSettingsCollection/pip-frontend-b2c-staff"
          + backend_http_settings_name = "pip-frontend-b2c-staff"
          + http_listener_id           = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/httpListeners/pip-frontend-b2c-staff"
          + http_listener_name         = "pip-frontend-b2c-staff"
          + id                         = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/requestRoutingRules/pip-frontend-b2c-staff"
          + name                       = "pip-frontend-b2c-staff"
          + priority                   = 50
          + rewrite_rule_set_id        = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendAddressPools/sds-api-mgmt"
          + backend_address_pool_name  = "sds-api-mgmt"
          + backend_http_settings_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendHttpSettingsCollection/sds-api-mgmt"
          + backend_http_settings_name = "sds-api-mgmt"
          + http_listener_id           = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/httpListeners/sds-api-mgmt"
          + http_listener_name         = "sds-api-mgmt"
          + id                         = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/requestRoutingRules/sds-api-mgmt"
          + name                       = "sds-api-mgmt"
          + priority                   = 60
          + rewrite_rule_set_id        = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendAddressPools/toffee"
          + backend_address_pool_name  = "toffee"
          + backend_http_settings_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/backendHttpSettingsCollection/toffee"
          + backend_http_settings_name = "toffee"
          + http_listener_id           = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/httpListeners/toffee"
          + http_listener_name         = "toffee"
          + id                         = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/requestRoutingRules/toffee"
          + name                       = "toffee"
          + priority                   = 10
          + rewrite_rule_set_id        = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "darts-portal"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "darts-portal"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "darts-portal"
          + id                          = (known after apply)
          + name                        = "darts-portal"
          + priority                    = 100
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "hmcts-courtfines-ithc"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "hmcts-courtfines-ithc"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "hmcts-courtfines-ithc"
          + id                          = (known after apply)
          + name                        = "hmcts-courtfines-ithc"
          + priority                    = 110
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "opal-frontend"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "opal-frontend"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "opal-frontend"
          + id                          = (known after apply)
          + name                        = "opal-frontend"
          + priority                    = 90
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (18 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label 543: ithc_appgateway - TerraformPlanApply/add-or-update: POST https://api.github.com/repos/hmcts/sds-azure-platform/issues/961/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":961,"Program":"tfcmt","SHA1":"","Target":"543: ithc_appgateway - TerraformPlanApply","Vars":{}} -->